//#include <stdio.h>
//#include <stdlib.h>
//#include <time.h>
//int main()
//{
//	int lj1[10000], lj2[10000], cp[10000] = { 0 }, r, i, j, k, n1, n2, b1, b2, b11, b22, b3, b33, b4, b5, tui, temp, temp1, making;//cp1234
//	int max = 0;
//	srand(time(NULL));
//	i = 0;
//	while (i < 2)
//	{
//		r = rand() % 10 + 1;
//		if (r = 1)
//		{
//			lj1[i] = 0;//随机生成对应比例损坏的零件1 
//		}
//		else
//		{
//			lj1[i] = 1;//合格的零件1 
//		}
//		i++;
//	}
//	i = 0;
//	while (i < 2)
//	{
//		r = rand() % 10 + 1;
//		if (r = 1)
//		{
//			lj2[i] = 0;//损坏的零件2 
//		}
//		else
//		{
//			lj2[i] = 1;//合格的零件2 
//		}
//		i++;
//	}                //生成初始数组 
//	b1 = 0; b11 = 0; b22 = 0;
//	while (b1 < 2)//检测b1个零件1 
//	{
//		b11 = 0; b22 = 0;
//		i = 0;
//		while (i < b1)
//		{
//			if (lj1[i] == 0)
//			{
//				b11++;
//			}
//			i++;
//		}         //统计第一次检测零件1检测出的不合格件数 
//		for (i = 0; i < b1; i++)
//		{
//			for (j = 0; j < b1 - i - 1; j++)
//			{
//				if (lj1[j] > lj1[j + 1])
//				{
//					temp = lj1[j];
//					lj1[j] = lj1[j + 1];
//					lj1[j + 1] = temp;
//				}
//			}
//		}     //冒泡排序修正零件1数组 （不合格品放在前面） 
//		b2 = 0;
//		while (b2 < 2)//检测b2个零件2 
//		{
//			i = 0;
//			while (i < b2)
//			{
//				if (lj2[i] == 0)
//				{
//					b22++;
//				}
//				i++;
//			}//统计不合格件数 
//			i = 0; j = 0;
//			for (i = 0; i < b2; i++)
//			{
//				for (j = 0; j < b2 - i - 1; j++)
//				{
//					if (lj2[j] > lj2[j + 1])
//					{
//						temp = lj2[j];
//						lj2[j] = lj2[j + 1];
//						lj2[j + 1] = temp;
//					}
//				}
//			}//冒泡排序修正零件2数组 
//			if (b11 <= b22)//比较检测出的零件1和零件2的不合格件数，不合格件数多的为确定无法组装出的成品数量temp 
//			{
//				temp = b22;
//			}
//			else
//			{
//				temp = b11;
//			}
//			i = 0;
//			while (i < temp)
//			{
//				cp[i] = 0;
//				i++;
//			}//无法组装为成品 ，初始化前temp个成品不组装，为不合格 
//			i = temp;//从temp个零件1和零件2开始组装成品 
//			while (i < 2)
//			{
//				r = rand() % 10 + 1;
//				if ((lj1[i] == 0) || (lj2[i] == 0) || (r == 1))
//				{
//					cp[b1] = 0;
//				}//产生次品 ， 
//				else
//				{
//					cp[b1] = 1;
//				}//产生成品 
//				i++;
//			}
//			b3 = 0;
//			while (b3 + temp < 10)//对已组装的成品进行b3次检测（从cp数组中temp开始 检测到b3+temp） 
//			{
//				b33 = 0;
//				i = temp;
//				while (i < b3 + temp)
//				{
//					if (cp[i] == 0)
//					{
//						b33++;
//					}
//					i++;
//				}//统计成品不合格件数b33 
//				for (i = temp; i < b3 + temp; i++)
//				{
//					for (j = temp; j < b3 + temp - i - 1; j++)
//					{
//						if (cp[j] > cp[j + 1])
//						{
//							temp1 = cp[j]; cp[j] = cp[j + 1]; cp[j + 1] = temp1;
//							temp1 = lj1[j]; lj1[j] = lj1[j + 1]; lj1[j + 1] = temp1;
//							temp1 = lj2[j]; lj2[j] = lj2[j + 1]; lj2[j + 1] = temp1;
//						}
//					}
//				}//冒泡排序修正初始数组 ，即将不合格的成品放在temp到temp+b33的位置； 
//				b4 = 0; tui = 0;
//				while (b4 < b33)//拆解部分拆解b4个成品 
//				{
//					i = temp + b3;//成品从temp+b3个开始是直接组装未经检测直接售出 
//					while (i < 10)
//					{
//						if (cp[i] == 0)
//						{
//							tui++;
//						}
//						i++;
//					}  //直接售出统计退回不合格件数 
//					for (i = temp + b33; i < 2; i++)
//					{
//						for (j = temp + b33; j < 2 - i - 1; j++)
//						{
//							if (cp[j] > cp[j + 1])
//							{
//								temp1 = cp[j]; cp[j] = cp[j + 1]; cp[j + 1] = temp1;
//								temp1 = lj1[j]; lj1[j] = lj1[j + 1]; lj1[j + 1] = temp1;
//								temp1 = lj2[j]; lj2[j] = lj2[j + 1]; lj2[j + 1] = temp1;
//							}
//						}
//					}//冒泡排序修正cp数组,将退回的不合格品 放在temp+b33到 temp+b33+tui的位置上 
//					//对于不合格品需要拆解，拆解会产生费用，同时回到环节1，2进行循环，直到没有拆解 
//
//					making = (-4) * 10000 + (-2) * b1 + (-3) * b2 + (-18) * 10000 + (-6) * (10000 - temp) + (-3) * b3 + 56 * (10000 - temp - b33) + (-5) * b4 + (-6) * tui;//计算总利润 
//					if (max <= making)
//					{
//						max = making;
//						printf("%d,%d,%d,%d,%d/n", b1, b2, b3, b4, making);//利润高的显示此时的情形 
//					}
//
//					b4++;
//				}
//
//
//
//
//				b3++;
//			}
//
//
//			b2++;
//		}
//
//
//		b1++;
//	}
//
//
//
//
//
//	return 0;
//}
