//行指针
// 行指针本身是一个数组，其数组元素为低维普通数组，但大小指定
//声明行指针的语法
//数据类型(*行指针名)[子数组的大小]

//行指针介绍
void Test1() {
	int* a;//指向int的指针
	int* a[5];//大小为5的数组，数组里存放int*
	int(*a)[5];//a指向一个int[5]，行指针
}
//二维数组名的解释
void Test2() {
	int a[2][3];
	//a被解释为 int[3]的行地址
	int(*pa)[3] = a;
}
//二维数组大小的自动推导
void Test3() {
	//int a[2][] = { {1,2,3},{1,2,3} };//推导不出来
	int a[][3] = { {1,2,3},{1,2,3} };
	//int(*)[3]等于int[][3]


	int* b[2] = { a[0],a[1] };//引导再封装
}


int main() {
	int(*p1)[3];//p1是行指针
	//1.指向一个大小为3的int数组
	//2.指向一个以大小为3的int数组为元素的二维数组


	int a[10];

	int* p1 = a;
	int(*p2)[10] = &a;//&a类型为int(*)[10],是行指针
	//int* p3[10] = &a;
	

}